// all applicable accented letters sorted by language
export const letters = {
    all: [
        "¡", "¿",
        "á", "à", "ă", "â", "å", "ä", "ã", "ą", "æ",
        "ć", "č", "ç", "ð",
        "é", "è", "ê", "ě", "ë", "ę", "ğ",
        "í", "ì", "î", "ï", "İ", "ı",
        "ł", "ń", "ň", "ñ",
        "ó", "ò", "ô", "ö", "ő", "õ", "ø", "œ",
        "ř", "ś", "š", "ş", "ș", "ß",
        "ţ", "ț",
        "ú", "ù", "û", "ů", "ü", "ű",
        "ý", "ź", "ž", "ż",
        "þ"
    ],

    spanish: [
        "¡", "¿",
        "á", "é", "í", "ñ", "ó", "ú", "ü"
    ],

    french: [
        "«", "»",
        "à", "â", "ç",
        "é", "è", "ê", "ë",
        "î", "ï",
        "ô",
        "œ",
        "ù", "û",
        "ÿ"
    ],

    portuguese: [
        "á", "à", "â", "ã",
        "ç",
        "é", "ê",
        "í",
        "ó", "ô", "õ",
        "ú"
    ],

    italian: [
        "à",
        "è",
        "ì",
        "ò",
        "ù"
    ],

    german: [
        "ä",
        "ö",
        "ü",
        "ß"
    ],

    swedish: [
        "å", "ä",
        "ö"
    ],

    danish: [
        "å", "æ",
        "ø"
    ],

    norwegian: [
        "å",
        "æ",
        "ø"
    ],

    finnish: [
        "ä",
        "ö"
    ],

    polish: [
        "ą",
        "ć",
        "ę",
        "ł",
        "ń",
        "ó",
        "ś",
        "ź",
        "ż"
    ],

    lithuanian: [
        "ą",
        "č",
        "ę", "ė",
        "į",
        "š",
        "ų",
        "ū",
        "ž"
    ],

    czech: [
        "á",
        "č",
        "é",
        "ě",
        "í",
        "ň",
        "ó",
        "ř",
        "š",
        "ú", "ů",
        "ý",
        "ž"
    ],

    slovak: [
        "á", "ä",
        "č",
        "ď",
        "é",
        "í", "ľ",
        "ň",
        "ó", "ô",
        "ŕ",
        "š",
        "ť",
        "ú",
        "ý",
        "ž"
    ],

    slovenian: [
        "č",
        "š",
        "ž"
    ],

    croatian: [
        "ć",
        "č",
        "đ",
        "š",
        "ž"
    ],

    romanian: [
        "ă",
        "â",
        "î",
        "ş", "ș",
        "ţ", "ț"
    ],

    turkish: [
        "ç",
        "ğ",
        "İ",
        "ı",
        "ö",
        "ş",
        "ü"
    ],

    hungarian: [
        "á",
        "é",
        "í",
        "ó",
        "ö", "ő",
        "ú", "ü", "ű"
    ],

    dutch: [
        "ë",
        "ï"
    ],

    estonian: [
        "ä",
        "õ", "ö",
        "ü"
    ],

    icelandic: [
        "á",
        "æ",
        "é",
        "ð", "ö", "ó",
        "þ",
        "ý"
    ]
};

export const allLetters = Object.values(letters).flat();